/**
 * Created by zhaixm on 2017/12/27.
 */
export const AREA_DATA = {
  /*"provinces": [
    {
      "name": "北京市",
      "citys": [
        "东城区",
        "西城区",
        "崇文区",
        "宣武区",
        "朝阳区",
        "海淀区",
        "丰台区",
        "石景山区",
        "房山区",
        "通州区",
        "顺义区",
        "昌平区",
        "大兴区",
        "怀柔区",
        "平谷区",
        "门头沟区",
        "密云区",
        "延庆区",
        "其他"
      ]
    },
    {
      "name": "广东省",
      "citys": [
        "广州",
        "深圳",
        "珠海",
        "汕头",
        "韶关",
        "佛山",
        "江门",
        "湛江",
        "茂名",
        "肇庆",
        "惠州",
        "梅州",
        "汕尾",
        "河源",
        "阳江",
        "清远",
        "东莞",
        "中山",
        "潮州",
        "揭阳",
        "云浮",
        "其他"
      ]
    },
    {
      "name": "上海市",
      "citys": [
        "黄浦区",
        "卢湾区",
        "徐汇区",
        "长宁区",
        "静安区",
        "普陀区",
        "闸北区",
        "虹口区",
        "杨浦区",
        "宝山区",
        "闵行区",
        "嘉定区",
        "松江区",
        "金山区",
        "青浦区",
        "南汇区",
        "奉贤区",
        "浦东新区",
        "崇明区",
        "其他"
      ]
    },
    {
      "name": "天津市",
      "citys": [
        "和平区",
        "河东区",
        "河西区",
        "南开区",
        "河北区",
        "红桥区",
        "塘沽区",
        "汉沽区",
        "大港区",
        "东丽区",
        "西青区",
        "北辰区",
        "津南区",
        "武清区",
        "宝坻区",
        "静海县",
        "宁河县",
        "蓟县",
        "其他"
      ]
    },
    {
      "name": "重庆市",
      "citys": [
        "渝中区",
        "大渡口区",
        "江北区",
        "南岸区",
        "北碚区",
        "渝北区",
        "巴南区",
        "长寿区",
        "双桥区",
        "沙坪坝区",
        "万盛区",
        "万州区",
        "涪陵区",
        "黔江区",
        "永川区",
        "合川区",
        "江津区",
        "九龙坡区",
        "南川区",
        "綦江县",
        "潼南区",
        "荣昌区",
        "璧山区",
        "大足区",
        "铜梁县",
        "梁平县",
        "开县",
        "忠县",
        "城口县",
        "垫江区",
        "武隆县",
        "丰都县",
        "奉节县",
        "云阳县",
        "巫溪县",
        "巫山县",
        "其他"
      ]
    },
    {
      "name": "辽宁省",
      "citys": [
        "沈阳",
        "大连",
        "鞍山",
        "抚顺",
        "本溪",
        "丹东",
        "锦州",
        "营口",
        "阜新",
        "辽阳",
        "盘锦",
        "铁岭",
        "朝阳",
        "葫芦岛",
        "其他"
      ]
    },
    {
      "name": "江苏省",
      "citys": [
        "南京",
        "苏州",
        "无锡",
        "常州",
        "镇江",
        "南通",
        "泰州",
        "扬州",
        "盐城",
        "连云港",
        "徐州",
        "淮安",
        "宿州",
        "其他"
      ]
    },
    {
      "name": "湖北省",
      "citys": [
        "武汉",
        "黄石",
        "十堰",
        "荆州",
        "宜昌",
        "襄樊",
        "鄂州",
        "荆门",
        "孝感",
        "黄冈",
        "咸宁",
        "随州",
        "仙桃",
        "天门",
        "潜江",
        "神农架",
        "其他"
      ]
    },
    {
      "name": "四川省",
      "citys": [
        "成都",
        "自贡",
        "攀枝花",
        "泸州",
        "德阳",
        "绵阳",
        "广元",
        "遂宁",
        "内江",
        "乐山",
        "南充",
        "眉山",
        "宜宾",
        "广安",
        "达州",
        "雅安",
        "巴中",
        "资阳",
        "其他"
      ]
    },
    {
      "name": "陕西省",
      "citys": [
        "西安",
        "铜川",
        "宝鸡",
        "咸阳",
        "渭南",
        "延安",
        "汉中",
        "榆林",
        "安康",
        "商洛",
        "其他"
      ]
    },
    {
      "name": "河北省",
      "citys": [
        "石家庄",
        "唐山",
        "秦皇岛",
        "邯郸",
        "邢台",
        "保定",
        "张家口",
        "承德",
        "沧州",
        "廊坊",
        "衡水",
        "其他"
      ]
    },
    {
      "name": "山西省",
      "citys": [
        "太原",
        "大同",
        "阳泉",
        "长治",
        "晋城",
        "朔州",
        "晋中",
        "运城",
        "忻州",
        "临汾",
        "吕梁",
        "其他"
      ]
    },
    {
      "name": "河南省",
      "citys": [
        "郑州",
        "开封",
        "洛阳",
        "平顶山",
        "安阳",
        "鹤壁",
        "新乡",
        "焦作",
        "濮阳",
        "许昌",
        "漯河",
        "三门峡",
        "南阳",
        "商丘",
        "信阳",
        "周口",
        "驻马店",
        "焦作",
        "其他"
      ]
    },
    {
      "name": "吉林省",
      "citys": [
        "吉林",
        "四平",
        "辽源",
        "通化",
        "白山",
        "松原",
        "白城",
        "延边朝鲜自治区",
        "其他"
      ]
    },
    {
      "name": "黑龙江",
      "citys": [
        "哈尔滨",
        "齐齐哈尔",
        "鹤岗",
        "双鸭山",
        "鸡西",
        "大庆",
        "伊春",
        "牡丹江",
        "佳木斯",
        "七台河",
        "黑河",
        "绥远",
        "大兴安岭地区",
        "其他"
      ]
    },
    {
      "name": "内蒙古",
      "citys": [
        "呼和浩特",
        "包头",
        "乌海",
        "赤峰",
        "通辽",
        "鄂尔多斯",
        "呼伦贝尔",
        "巴彦淖尔",
        "乌兰察布",
        "锡林郭勒盟",
        "兴安盟",
        "阿拉善盟"
      ]
    },
    {
      "name": "山东省",
      "citys": [
        "济南",
        "青岛",
        "淄博",
        "枣庄",
        "东营",
        "烟台",
        "潍坊",
        "济宁",
        "泰安",
        "威海",
        "日照",
        "莱芜",
        "临沂",
        "德州",
        "聊城",
        "滨州",
        "菏泽",
        "其他"
      ]
    },
    {
      "name": "安徽省",
      "citys": [
        "合肥",
        "芜湖",
        "蚌埠",
        "淮南",
        "马鞍山",
        "淮北",
        "铜陵",
        "安庆",
        "黄山",
        "滁州",
        "阜阳",
        "宿州",
        "巢湖",
        "六安",
        "亳州",
        "池州",
        "宣城"
      ]
    },
    {
      "name": "浙江省",
      "citys": [
        "杭州",
        "宁波",
        "温州",
        "嘉兴",
        "湖州",
        "绍兴",
        "金华",
        "衢州",
        "舟山",
        "台州",
        "丽水",
        "其他"
      ]
    },
    {
      "name": "福建省",
      "citys": [
        "福州",
        "厦门",
        "莆田",
        "三明",
        "泉州",
        "漳州",
        "南平",
        "龙岩",
        "宁德",
        "其他"
      ]
    },
    {
      "name": "湖南省",
      "citys": [
        "长沙",
        "株洲",
        "湘潭",
        "衡阳",
        "邵阳",
        "岳阳",
        "常德",
        "张家界",
        "益阳",
        "滨州",
        "永州",
        "怀化",
        "娄底",
        "其他"
      ]
    },
    {
      "name": "广西省",
      "citys": [
        "南宁",
        "柳州",
        "桂林",
        "梧州",
        "北海",
        "防城港",
        "钦州",
        "贵港",
        "玉林",
        "百色",
        "贺州",
        "河池",
        "来宾",
        "崇左",
        "其他"
      ]
    },
    {
      "name": "江西省",
      "citys": [
        "南昌",
        "景德镇",
        "萍乡",
        "九江",
        "新余",
        "鹰潭",
        "赣州",
        "吉安",
        "宜春",
        "抚州",
        "上饶",
        "其他"
      ]
    },
    {
      "name": "贵州省",
      "citys": [
        "贵阳",
        "六盘水",
        "遵义",
        "安顺",
        "铜仁",
        "毕节",
        "其他"
      ]
    },
    {
      "name": "云南省",
      "citys": [
        "昆明",
        "曲靖",
        "玉溪",
        "保山",
        "邵通",
        "丽江",
        "普洱",
        "临沧",
        "其他"
      ]
    },
    {
      "name": "西藏",
      "citys": [
        "拉萨",
        "那曲地区",
        "昌都地区",
        "林芝地区",
        "山南区",
        "阿里区",
        "日喀则",
        "其他"
      ]
    },
    {
      "name": "海南省",
      "citys": [
        "海口",
        "三亚",
        "五指山",
        "琼海",
        "儋州",
        "文昌",
        "万宁",
        "东方",
        "澄迈县",
        "定安县",
        "屯昌县",
        "临高县",
        "其他"
      ]
    },
    {
      "name": "甘肃省",
      "citys": [
        "兰州",
        "嘉峪关",
        "金昌",
        "白银",
        "天水",
        "武威",
        "酒泉",
        "张掖",
        "庆阳",
        "平凉",
        "定西",
        "陇南",
        "临夏",
        "甘南",
        "其他"
      ]
    },
    {
      "name": "宁夏",
      "citys": [
        "银川",
        "石嘴山",
        "吴忠",
        "固原",
        "中卫",
        "其他"
      ]
    },
    {
      "name": "青海",
      "citys": [
        "西宁",
        "海东地区",
        "海北藏族自治区",
        "海南藏族自治区",
        "黄南藏族自治区",
        "果洛藏族自治区",
        "玉树藏族自治州",
        "还西藏族自治区",
        "其他"
      ]
    },
    {
      "name": "新疆",
      "citys": [
        "乌鲁木齐",
        "克拉玛依",
        "吐鲁番地区",
        "哈密地区",
        "和田地区",
        "阿克苏地区",
        "喀什地区",
        "克孜勒苏柯尔克孜",
        "巴音郭楞蒙古自治区",
        "昌吉回族自治州",
        "博尔塔拉蒙古自治区",
        "石河子",
        "阿拉尔",
        "图木舒克",
        "五家渠",
        "伊犁哈萨克自治区",
        "其他"
      ]
    }
  ]*/

  provinces:[
    {
      "code": "110000",
      "region": "北京市",
      "regionEntitys": [{"code": "110101", "region": "东城区"}, {"code": "110102", "region": "西城区"}, {
        "code": "110105",
        "region": "朝阳区"
      }, {"code": "110106", "region": "丰台区"}, {"code": "110107", "region": "石景山区"}, {
        "code": "110108",
        "region": "海淀区"
      }, {"code": "110109", "region": "门头沟区"}, {"code": "110111", "region": "房山区"}, {
        "code": "110112",
        "region": "通州区"
      }, {"code": "110113", "region": "顺义区"}, {"code": "110114", "region": "昌平区"}, {
        "code": "110115",
        "region": "大兴区"
      }, {"code": "110116", "region": "怀柔区"}, {"code": "110117", "region": "平谷区"}, {
        "code": "110118",
        "region": "密云区"
      }, {"code": "110119", "region": "延庆区"}]

    },
    {
      "code": "120000",
      "region": "天津市",
      "regionEntitys": [{"code": "120101", "region": "和平区"}, {"code": "120102", "region": "河东区"}, {
        "code": "120103",
        "region": "河西区"
      }, {"code": "120104", "region": "南开区"}, {"code": "120105", "region": "河北区"}, {
        "code": "120106",
        "region": "红桥区"
      }, {"code": "120110", "region": "东丽区"}, {"code": "120111", "region": "西青区"}, {
        "code": "120112",
        "region": "津南区"
      }, {"code": "120113", "region": "北辰区"}, {"code": "120114", "region": "武清区"}, {
        "code": "120115",
        "region": "宝坻区"
      }, {"code": "120116", "region": "滨海新区"}, {"code": "120117", "region": "宁河区"}, {
        "code": "120118",
        "region": "静海区"
      }, {"code": "120119", "region": "蓟州区"}]

    },
    {
      "code": "130000",
      "region": "河北省",
      "regionEntitys": [{
        "code": "130100",
        "region": "石家庄市",
      }, {
        "code": "130200",
        "region": "唐山市",
      }, {
        "code": "130300",
        "region": "秦皇岛市",

      }, {
        "code": "130400",
        "region": "邯郸市",

      }, {
        "code": "130500",
        "region": "邢台市",

      }, {
        "code": "130600",
        "region": "保定市",

      }, {
        "code": "130700",
        "region": "张家口市",

      }, {
        "code": "130800",
        "region": "承德市",

      }, {
        "code": "130900",
        "region": "沧州市",

      }, {
        "code": "131000",
        "region": "廊坊市",

      }, {
        "code": "131100",
        "region": "衡水市",

      }]
    },
    {
      "code": "140000",
      "region": "山西省",
      "regionEntitys": [{
        "code": "140100",
        "region": "太原市",

      }, {
        "code": "140200",
        "region": "大同市",

      }, {
        "code": "140300",
        "region": "阳泉市",

      }, {
        "code": "140400",
        "region": "长治市",

      }, {
        "code": "140500",
        "region": "晋城市",

      }, {
        "code": "140600",
        "region": "朔州市",

      }, {
        "code": "140700",
        "region": "晋中市",

      }, {
        "code": "140800",
        "region": "运城市",

      }, {
        "code": "140900",
        "region": "忻州市",

      }, {
        "code": "141000",
        "region": "临汾市",

      }, {
        "code": "141100",
        "region": "吕梁市",

      }]
    },
    {
      "code": "150000",
      "region": "内蒙古自治区",
      "regionEntitys": [{
        "code": "150100",
        "region": "呼和浩特市",

      }, {
        "code": "150200",
        "region": "包头市",

      }, {
        "code": "150300",
        "region": "乌海市",

      }, {
        "code": "150400",
        "region": "赤峰市",

      }, {
        "code": "150500",
        "region": "通辽市",

      }, {
        "code": "150600",
        "region": "鄂尔多斯市",

      }, {
        "code": "150700",
        "region": "呼伦贝尔市",

      }, {
        "code": "150800",
        "region": "巴彦淖尔市",

      }, {
        "code": "150900",
        "region": "乌兰察布市",

      }, {
        "code": "152200",
        "region": "兴安盟",

      }, {
        "code": "152500",
        "region": "锡林郭勒盟",

      }, {
        "code": "152900",
        "region": "阿拉善盟",
      }]
    },
    {
      "code": "210000",
      "region": "辽宁省",
      "regionEntitys": [{
        "code": "210100",
        "region": "沈阳市",

      }, {
        "code": "210200",
        "region": "大连市",

      }, {
        "code": "210300",
        "region": "鞍山市",

      }, {
        "code": "210400",
        "region": "抚顺市",

      }, {
        "code": "210500",
        "region": "本溪市",

      }, {
        "code": "210600",
        "region": "丹东市",

      }, {
        "code": "210700",
        "region": "锦州市",

      }, {
        "code": "210800",
        "region": "营口市",

      }, {
        "code": "210900",
        "region": "阜新市",

      }, {
        "code": "211000",
        "region": "辽阳市",

      }, {
        "code": "211100",
        "region": "盘锦市",

      }, {
        "code": "211200",
        "region": "铁岭市",

      }, {
        "code": "211300",
        "region": "朝阳市",

      }, {
        "code": "211400",
        "region": "葫芦岛市",

      }]
    },
    {
      "code": "220000",
      "region": "吉林省",
      "regionEntitys": [{
        "code": "220100",
        "region": "长春市",

      }, {
        "code": "220200",
        "region": "吉林市",

      }, {
        "code": "220300",
        "region": "四平市",

      }, {
        "code": "220400",
        "region": "辽源市",

      }, {
        "code": "220500",
        "region": "通化市",

      }, {
        "code": "220600",
        "region": "白山市",

      }, {
        "code": "220700",
        "region": "松原市",

      }, {
        "code": "220800",
        "region": "白城市",

      }, {
        "code": "222400",
        "region": "延边朝鲜族自治州",

      }]
    },
    {
      "code": "230000",
      "region": "黑龙江省",
      "regionEntitys": [{
        "code": "230100",
        "region": "哈尔滨市",

      }, {
        "code": "230200",
        "region": "齐齐哈尔市",

      }, {
        "code": "230300",
        "region": "鸡西市",

      }, {
        "code": "230400",
        "region": "鹤岗市",

      }, {
        "code": "230500",
        "region": "双鸭山市",

      }, {
        "code": "230600",
        "region": "大庆市",

      }, {
        "code": "230700",
        "region": "伊春市",

      }, {
        "code": "230800",
        "region": "佳木斯市",

      }, {
        "code": "230900",
        "region": "七台河市",

      }, {
        "code": "231000",
        "region": "牡丹江市",

      }, {
        "code": "231100",
        "region": "黑河市",

      }, {
        "code": "231200",
        "region": "绥化市",

      }, {
        "code": "232700",
        "region": "大兴安岭地区",

      }]
    },
    {
      "code": "310000",
      "region": "上海市",
      "regionEntitys": [{"code": "310101", "region": "黄浦区"}, {"code": "310104", "region": "徐汇区"}, {
        "code": "310105",
        "region": "长宁区"
      }, {"code": "310106", "region": "静安区"}, {"code": "310107", "region": "普陀区"}, {
        "code": "310109",
        "region": "虹口区"
      }, {"code": "310110", "region": "杨浦区"}, {"code": "310112", "region": "闵行区"}, {
        "code": "310113",
        "region": "宝山区"
      }, {"code": "310114", "region": "嘉定区"}, {"code": "310115", "region": "浦东新区"}, {
        "code": "310116",
        "region": "金山区"
      }, {"code": "310117", "region": "松江区"}, {"code": "310118", "region": "青浦区"}, {
        "code": "310120",
        "region": "奉贤区"
      }, {"code": "310151", "region": "崇明区"}]
    },
    {
      "code": "320000",
      "region": "江苏省",
      "regionEntitys": [{
        "code": "320100",
        "region": "南京市",

      }, {
        "code": "320200",
        "region": "无锡市",

      }, {
        "code": "320300",
        "region": "徐州市",

      }, {
        "code": "320400",
        "region": "常州市",

      }, {
        "code": "320500",
        "region": "苏州市",

      }, {
        "code": "320600",
        "region": "南通市",

      }, {
        "code": "320700",
        "region": "连云港市",

      }, {
        "code": "320800",
        "region": "淮安市",

      }, {
        "code": "320900",
        "region": "盐城市",

      }, {
        "code": "321000",
        "region": "扬州市",

      }, {
        "code": "321100",
        "region": "镇江市",

      }, {
        "code": "321200",
        "region": "泰州市",

      }, {
        "code": "321300",
        "region": "宿迁市",

      }]
    },
    {
      "code": "330000",
      "region": "浙江省",
      "regionEntitys": [{
        "code": "330100",
        "region": "杭州市",

      }, {
        "code": "330200",
        "region": "宁波市",

      }, {
        "code": "330300",
        "region": "温州市",

      }, {
        "code": "330400",
        "region": "嘉兴市",

      }, {
        "code": "330500",
        "region": "湖州市",

      }, {
        "code": "330600",
        "region": "绍兴市",

      }, {
        "code": "330700",
        "region": "金华市",

      }, {
        "code": "330800",
        "region": "衢州市",

      }, {
        "code": "330900",
        "region": "舟山市",

      }, {
        "code": "331000",
        "region": "台州市",

      }, {
        "code": "331100",
        "region": "丽水市",

      }]
    },
    {
      "code": "340000",
      "region": "安徽省",
      "regionEntitys": [{
        "code": "340100",
        "region": "合肥市",

      }, {
        "code": "340200",
        "region": "芜湖市",

      }, {
        "code": "340300",
        "region": "蚌埠市",

      }, {
        "code": "340400",
        "region": "淮南市",

      }, {
        "code": "340500",
        "region": "马鞍山市",

      }, {
        "code": "340600",
        "region": "淮北市",

      }, {
        "code": "340700",
        "region": "铜陵市",

      }, {
        "code": "340800",
        "region": "安庆市",

      }, {
        "code": "341000",
        "region": "黄山市",

      }, {
        "code": "341100",
        "region": "滁州市",

      }, {
        "code": "341200",
        "region": "阜阳市",

      }, {
        "code": "341300",
        "region": "宿州市",

      }, {
        "code": "341500",
        "region": "六安市",

      }, {
        "code": "341600",
        "region": "亳州市",

      }, {
        "code": "341700",
        "region": "池州市",

      }, {
        "code": "341800",
        "region": "宣城市",

      }]
    },
    {
      "code": "350000",
      "region": "福建省",
      "regionEntitys": [{
        "code": "350100",
        "region": "福州市",

      }, {
        "code": "350200",
        "region": "厦门市",

      }, {
        "code": "350300",
        "region": "莆田市",

      }, {
        "code": "350400",
        "region": "三明市",

      }, {
        "code": "350500",
        "region": "泉州市",

      }, {
        "code": "350600",
        "region": "漳州市",

      }, {
        "code": "350700",
        "region": "南平市",

      }, {
        "code": "350800",
        "region": "龙岩市",

      }, {
        "code": "350900",
        "region": "宁德市",

      }]
    },
    {
      "code": "360000",
      "region": "江西省",
      "regionEntitys": [{
        "code": "360100",
        "region": "南昌市",

      }, {
        "code": "360200",
        "region": "景德镇市",

      }, {
        "code": "360300",
        "region": "萍乡市",

      }, {
        "code": "360400",
        "region": "九江市",

      }, {
        "code": "360500",
        "region": "新余市",

      }, {
        "code": "360600",
        "region": "鹰潭市",

      }, {
        "code": "360700",
        "region": "赣州市",

      }, {
        "code": "360800",
        "region": "吉安市",

      }, {
        "code": "360900",
        "region": "宜春市",

      }, {
        "code": "361000",
        "region": "抚州市",

      }, {
        "code": "361100",
        "region": "上饶市",

      }]
    },
    {
      "code": "370000",
      "region": "山东省",
      "regionEntitys": [{
        "code": "370100",
        "region": "济南市",

      }, {
        "code": "370200",
        "region": "青岛市",

      }, {
        "code": "370300",
        "region": "淄博市",

      }, {
        "code": "370400",
        "region": "枣庄市",

      }, {
        "code": "370500",
        "region": "东营市",

      }, {
        "code": "370600",
        "region": "烟台市",

      }, {
        "code": "370700",
        "region": "潍坊市",

      }, {
        "code": "370800",
        "region": "济宁市",

      }, {
        "code": "370900",
        "region": "泰安市",

      }, {
        "code": "371000",
        "region": "威海市",

      }, {
        "code": "371100",
        "region": "日照市",

      }, {
        "code": "371200",
        "region": "莱芜市",

      }, {
        "code": "371300",
        "region": "临沂市",

      }, {
        "code": "371400",
        "region": "德州市",

      }, {
        "code": "371500",
        "region": "聊城市",

      }, {
        "code": "371600",
        "region": "滨州市",

      }, {
        "code": "371700",
        "region": "菏泽市",

      }]
    },
    {
      "code": "410000",
      "region": "河南省",
      "regionEntitys": [{
        "code": "410100",
        "region": "郑州市",

      }, {
        "code": "410200",
        "region": "开封市",

      }, {
        "code": "410300",
        "region": "洛阳市",

      }, {
        "code": "410400",
        "region": "平顶山市",

      }, {
        "code": "410500",
        "region": "安阳市",

      }, {
        "code": "410600",
        "region": "鹤壁市",

      }, {
        "code": "410700",
        "region": "新乡市",

      }, {
        "code": "410800",
        "region": "焦作市",

      }, {
        "code": "410900",
        "region": "濮阳市",

      }, {
        "code": "411000",
        "region": "许昌市",

      }, {
        "code": "411100",
        "region": "漯河市",

      }, {
        "code": "411200",
        "region": "三门峡市",

      }, {
        "code": "411300",
        "region": "南阳市",

      }, {
        "code": "411400",
        "region": "商丘市",

      }, {
        "code": "411500",
        "region": "信阳市",

      }, {
        "code": "411600",
        "region": "周口市",

      }, {
        "code": "411700",
        "region": "驻马店市",

      }]
    },
    {
      "code": "420000",
      "region": "湖北省",
      "regionEntitys": [{
        "code": "420100",
        "region": "武汉市",

      }, {
        "code": "420200",
        "region": "黄石市",

      }, {
        "code": "420300",
        "region": "十堰市",

      }, {
        "code": "420500",
        "region": "宜昌市",

      }, {
        "code": "420600",
        "region": "襄阳市",

      }, {
        "code": "420700",
        "region": "鄂州市",

      }, {
        "code": "420800",
        "region": "荆门市",

      }, {
        "code": "420900",
        "region": "孝感市",

      }, {
        "code": "421000",
        "region": "荆州市",

      }, {
        "code": "421100",
        "region": "黄冈市",

      }, {
        "code": "421200",
        "region": "咸宁市",

      }, {
        "code": "421300",
        "region": "随州市",

      }, {
        "code": "422800",
        "region": "恩施土家族苗族自治州",

      }, {
        "code": "429000",
        "region": "省直辖县级行政区划",

      }]
    },
    {
      "code": "430000",
      "region": "湖南省",
      "regionEntitys": [{
        "code": "430100",
        "region": "长沙市",

      }, {
        "code": "430200",
        "region": "株洲市",

      }, {
        "code": "430300",
        "region": "湘潭市",

      }, {
        "code": "430400",
        "region": "衡阳市",

      }, {
        "code": "430500",
        "region": "邵阳市",

      }, {
        "code": "430600",
        "region": "岳阳市",

      }, {
        "code": "430700",
        "region": "常德市",

      }, {
        "code": "430800",
        "region": "张家界市",

      }, {
        "code": "430900",
        "region": "益阳市",

      }, {
        "code": "431000",
        "region": "郴州市",

      }, {
        "code": "431100",
        "region": "永州市",

      }, {
        "code": "431200",
        "region": "怀化市",

      }, {
        "code": "431300",
        "region": "娄底市",

      }, {
        "code": "433100",
        "region": "湘西土家族苗族自治州",

      }]
    },
    {
      "code": "440000",
      "region": "广东省",
      "regionEntitys": [{
        "code": "440100",
        "region": "广州市",

      }, {
        "code": "440200",
        "region": "韶关市",

      }, {
        "code": "440300",
        "region": "深圳市",

      }, {
        "code": "440400",
        "region": "珠海市",

      }, {
        "code": "440500",
        "region": "汕头市",

      }, {
        "code": "440600",
        "region": "佛山市",

      }, {
        "code": "440700",
        "region": "江门市",

      }, {
        "code": "440800",
        "region": "湛江市",

      }, {
        "code": "440900",
        "region": "茂名市",

      }, {
        "code": "441200",
        "region": "肇庆市",

      }, {
        "code": "441300",
        "region": "惠州市",

      }, {
        "code": "441400",
        "region": "梅州市",

      }, {
        "code": "441500",
        "region": "汕尾市",

      }, {
        "code": "441600",
        "region": "河源市",

      }, {
        "code": "441700",
        "region": "阳江市",

      }, {
        "code": "441800",
        "region": "清远市",

      }, {"code": "441900", "region": "东莞市"}, {"code": "442000", "region": "中山市"}, {
        "code": "445100",
        "region": "潮州市",

      }, {
        "code": "445200",
        "region": "揭阳市",

      }, {
        "code": "445300",
        "region": "云浮市",

      }]
    },
    {
      "code": "450000",
      "region": "广西壮族自治区",
      "regionEntitys": [{
        "code": "450100",
        "region": "南宁市",

      }, {
        "code": "450200",
        "region": "柳州市",

      }, {
        "code": "450300",
        "region": "桂林市",

      }, {
        "code": "450400",
        "region": "梧州市",

      }, {
        "code": "450500",
        "region": "北海市",

      }, {
        "code": "450600",
        "region": "防城港市",

      }, {
        "code": "450700",
        "region": "钦州市",

      }, {
        "code": "450800",
        "region": "贵港市",

      }, {
        "code": "450900",
        "region": "玉林市",

      }, {
        "code": "451000",
        "region": "百色市",

      }, {
        "code": "451100",
        "region": "贺州市",

      }, {
        "code": "451200",
        "region": "河池市",

      }, {
        "code": "451300",
        "region": "来宾市",

      }, {
        "code": "451400",
        "region": "崇左市",

      }]
    },
    {
      "code": "460000",
      "region": "海南省",
      "regionEntitys": [{
        "code": "460100",
        "region": "海口市",

      }, {
        "code": "460200",
        "region": "三亚市",

      }, {"code": "460300", "region": "三沙市"}, {"code": "460400", "region": "儋州市"}, {
        "code": "469000",
        "region": "省直辖县级行政区划",

      }]
    },
    {
      "code": "500000",
      "region": "重庆市",
      "regionEntitys": [{"code": "500101", "region": "万州区"}, {"code": "500102", "region": "涪陵区"}, {
        "code": "500103",
        "region": "渝中区"
      }, {"code": "500104", "region": "大渡口区"}, {"code": "500105", "region": "江北区"}, {
        "code": "500106",
        "region": "沙坪坝区"
      }, {"code": "500107", "region": "九龙坡区"}, {"code": "500108", "region": "南岸区"}, {
        "code": "500109",
        "region": "北碚区"
      }, {"code": "500110", "region": "綦江区"}, {"code": "500111", "region": "大足区"}, {
        "code": "500112",
        "region": "渝北区"
      }, {"code": "500113", "region": "巴南区"}, {"code": "500114", "region": "黔江区"}, {
        "code": "500115",
        "region": "长寿区"
      }, {"code": "500116", "region": "江津区"}, {"code": "500117", "region": "合川区"}, {
        "code": "500118",
        "region": "永川区"
      }, {"code": "500119", "region": "南川区"}, {"code": "500120", "region": "璧山区"}, {
        "code": "500151",
        "region": "铜梁区"
      }, {"code": "500152", "region": "潼南区"}, {"code": "500153", "region": "荣昌区"}, {"code": "500154", "region": "开州区"}]

    },
    {
      "code": "510000",
      "region": "四川省",
      "regionEntitys": [{
        "code": "510100",
        "region": "成都市",

      }, {
        "code": "510300",
        "region": "自贡市",

      }, {
        "code": "510400",
        "region": "攀枝花市",

      }, {
        "code": "510500",
        "region": "泸州市",

      }, {
        "code": "510600",
        "region": "德阳市",

      }, {
        "code": "510700",
        "region": "绵阳市",

      }, {
        "code": "510800",
        "region": "广元市",

      }, {
        "code": "510900",
        "region": "遂宁市",

      }, {
        "code": "511000",
        "region": "内江市",

      }, {
        "code": "511100",
        "region": "乐山市",

      }, {
        "code": "511300",
        "region": "南充市",

      }, {
        "code": "511400",
        "region": "眉山市",

      }, {
        "code": "511500",
        "region": "宜宾市",

      }, {
        "code": "511600",
        "region": "广安市",

      }, {
        "code": "511700",
        "region": "达州市",

      }, {
        "code": "511800",
        "region": "雅安市",

      }, {
        "code": "511900",
        "region": "巴中市",

      }, {
        "code": "512000",
        "region": "资阳市",

      }, {
        "code": "513200",
        "region": "阿坝藏族羌族自治州",

      }, {
        "code": "513300",
        "region": "甘孜藏族自治州",

      }, {
        "code": "513400",
        "region": "凉山彝族自治州",

      }]
    },
    {
      "code": "520000",
      "region": "贵州省",
      "regionEntitys": [{
        "code": "520100",
        "region": "贵阳市",

      }, {
        "code": "520200",
        "region": "六盘水市",

      }, {
        "code": "520300",
        "region": "遵义市",

      }, {
        "code": "520400",
        "region": "安顺市",

      }, {
        "code": "520500",
        "region": "毕节市",

      }, {
        "code": "520600",
        "region": "铜仁市",

      }, {
        "code": "522300",
        "region": "黔西南布依族苗族自治州",

      }, {
        "code": "522600",
        "region": "黔东南苗族侗族自治州",

      }, {
        "code": "522700",
        "region": "黔南布依族苗族自治州",

      }]
    },
    {
      "code": "530000",
      "region": "云南省",
      "regionEntitys": [{
        "code": "530100",
        "region": "昆明市",

      }, {
        "code": "530300",
        "region": "曲靖市",

      }, {
        "code": "530400",
        "region": "玉溪市",

      }, {
        "code": "530500",
        "region": "保山市",

      }, {
        "code": "530600",
        "region": "昭通市",

      }, {
        "code": "530700",
        "region": "丽江市",

      }, {
        "code": "530800",
        "region": "普洱市",

      }, {
        "code": "530900",
        "region": "临沧市",

      }, {
        "code": "532300",
        "region": "楚雄彝族自治州",

      }, {
        "code": "532500",
        "region": "红河哈尼族彝族自治州",

      }, {
        "code": "532600",
        "region": "文山壮族苗族自治州",

      }, {
        "code": "532800",
        "region": "西双版纳傣族自治州",

      }, {
        "code": "532900",
        "region": "大理白族自治州",

      }, {
        "code": "533100",
        "region": "德宏傣族景颇族自治州",
        "regionEntitys": [{"code": "533102", "region": "瑞丽市"}, {"code": "533103", "region": "芒市"}, {
          "code": "533122",
          "region": "梁河县"
        }, {"code": "533123", "region": "盈江县"}, {"code": "533124", "region": "陇川县"}]
      }, {
        "code": "533300",
        "region": "怒江傈僳族自治州",

      }, {
        "code": "533400",
        "region": "迪庆藏族自治州",

      }]
    },
    {
      "code": "540000",
      "region": "西藏自治区",
      "regionEntitys": [{
        "code": "540100",
        "region": "拉萨市",

      }, {
        "code": "540200",
        "region": "日喀则市",

      }, {
        "code": "540300",
        "region": "昌都市",

      }, {
        "code": "540400",
        "region": "林芝市",

      }, {
        "code": "540500",
        "region": "山南市",

      }, {
        "code": "542400",
        "region": "那曲地区",

      }, {
        "code": "542500",
        "region": "阿里地区",

      }]
    },
    {
      "code": "610000",
      "region": "陕西省",
      "regionEntitys": [{
        "code": "610100",
        "region": "西安市",

      }, {
        "code": "610200",
        "region": "铜川市",

      }, {
        "code": "610300",
        "region": "宝鸡市",

      }, {
        "code": "610400",
        "region": "咸阳市",

      }, {
        "code": "610500",
        "region": "渭南市",

      }, {
        "code": "610600",
        "region": "延安市",

      }, {
        "code": "610700",
        "region": "汉中市",

      }, {
        "code": "610800",
        "region": "榆林市",

      }, {
        "code": "610900",
        "region": "安康市",

      }, {
        "code": "611000",
        "region": "商洛市",

      }]
    },
    {
      "code": "620000",
      "region": "甘肃省",
      "regionEntitys": [{
        "code": "620100",
        "region": "兰州市",

      }, {"code": "620200", "region": "嘉峪关市", "regionEntitys": [{"code": "620201", "region": "市辖区"}]}, {
        "code": "620300",
        "region": "金昌市",

      }, {
        "code": "620400",
        "region": "白银市",

      }, {
        "code": "620500",
        "region": "天水市",

      }, {
        "code": "620600",
        "region": "武威市",

      }, {
        "code": "620700",
        "region": "张掖市",

      }, {
        "code": "620800",
        "region": "平凉市",

      }, {
        "code": "620900",
        "region": "酒泉市",

      }, {
        "code": "621000",
        "region": "庆阳市",

      }, {
        "code": "621100",
        "region": "定西市",

      }, {
        "code": "621200",
        "region": "陇南市",

      }, {
        "code": "622900",
        "region": "临夏回族自治州",

      }, {
        "code": "623000",
        "region": "甘南藏族自治州",

      }]
    },
    {
      "code": "630000",
      "region": "青海省",
      "regionEntitys": [{
        "code": "630100",
        "region": "西宁市",

      }, {
        "code": "630200",
        "region": "海东市",

      }, {
        "code": "632200",
        "region": "海北藏族自治州",

      }, {
        "code": "632300",
        "region": "黄南藏族自治州",

      }, {
        "code": "632500",
        "region": "海南藏族自治州",

      }, {
        "code": "632600",
        "region": "果洛藏族自治州",

      }, {
        "code": "632700",
        "region": "玉树藏族自治州",

      }, {
        "code": "632800",
        "region": "海西蒙古族藏族自治州",

      }]
    },
    {
      "code": "640000",
      "region": "宁夏回族自治区",
      "regionEntitys": [{
        "code": "640100",
        "region": "银川市",

      }, {
        "code": "640200",
        "region": "石嘴山市",

      }, {
        "code": "640300",
        "region": "吴忠市",

      }, {
        "code": "640400",
        "region": "固原市",

      }, {
        "code": "640500",
        "region": "中卫市",

      }]
    },
    {
      "code": "650000",
      "region": "新疆维吾尔自治区",
      "regionEntitys": [{
        "code": "650100",
        "region": "乌鲁木齐市",

      }, {
        "code": "650200",
        "region": "克拉玛依市",

      }, {
        "code": "650400",
        "region": "吐鲁番市",

      }, {
        "code": "650500",
        "region": "哈密市",

      }, {
        "code": "652300",
        "region": "昌吉回族自治州",

      }, {
        "code": "652700",
        "region": "博尔塔拉蒙古自治州",

      }, {
        "code": "652800",
        "region": "巴音郭楞蒙古自治州",

      }, {
        "code": "652900",
        "region": "阿克苏地区",

      }, {
        "code": "653000",
        "region": "克孜勒苏柯尔克孜自治州",

      }, {
        "code": "653100",
        "region": "喀什地区",

      }, {
        "code": "653200",
        "region": "和田地区",

      }, {
        "code": "654000",
        "region": "伊犁哈萨克自治州",

      }, {
        "code": "654200",
        "region": "塔城地区",

      }, {
        "code": "654300",
        "region": "阿勒泰地区",

      }, {
        "code": "659000",
        "region": "自治区直辖县级行政区划",

      }]
    }
  ]

}
