/**
 * Created by zhaixm on 2017/10/15.
 */

export const dicts = {
  "FUNC_TYPE": {
    1: "蔬菜类",
    2: "肉类",
    3: "水产类",
    4: "海鲜类",
    5: "干货类",
    6: "活禽",
    7: "杂货",
  },

  "ENABLE_STATUS": {
    0: "不可用",
    1: "可用",
  },

  "SEX": {
    0: "男",
    1: "女"
  },

  "SHOP_STATUS": {
    0: "注销",
    1: "正常",
    2: "超期"
  },

  "PAY_WAY": {
    1:"现金",
    2: "支付宝",
    3: "微信支付"
  },

  "TRANS_STATUS": {
    1: "已下单",
    2: "已支付",
    3: "已撤消",
    4: "已退款"
  },

  "MARKET_STATUS": {
     0: "未开业",
     1: "经营中"
  },

  "STALL_STATUS":{
<<<<<<< HEAD
    0: "未被使用",
    1: "已被使用"
=======
    0:"未使用",
    1:"在使用",
    2:"注销"
>>>>>>> 094e866ad806024d4db7036bc7fb46314d9424f2
  },

  "ELECTRONICSCALE_STATUS":{
    0: "正常",
    1: "损坏"
  },

  "EQUIPMENT_NAME":{
    1: "电子秤",
    2: "不锈钢架",
    3: "PC垫板",
    4: "PPP占板",
    5: "三防罩",
    6: "操作交易台",
    7: "上墙货架",
    8: "展示架",
    9: "交易台",
    10: "宰杀操作台",
    11: "蓄养池",
    12: "宰杀操作台"
  }
}
