/**
 * Created by zhaixm on 2017/10/15.
 */

export const dicts = {
  "FUNC_TYPE": {
    1: "蔬菜类",
    2: "肉类",
    3: "水产类",
    4: "海鲜类",
    5: "干货类",
    6: "活禽",
    7: "杂货",
  },

  "ENABLE_STATUS": {
    0: "不可用",
    1: "可用",
  },

  "SEX": {
    0: "男",
    1: "女"
  },

  "SHOP_STATUS": {
    0: "注销",
    1: "正常",
    2: "超期"
  },

  "PAY_WAY": {
    1: "支付宝",
    2: "微信支付"
  },

  "TRANS_STATUS": {
    1: "已下单",
    2: "已支付",
    3: "已撤消",
    4: "已退款"
  },

  "MARKET_STATUS": {
     0: "未开业",
     1: "经营中"
  }
}
